В этом домашнем задании мы будем работать с набором данных о пассажирах парохода "Титаник", потерпевшего крушение в 1912 году (источник: соревнование [Titanic: Machine Learning from Disaster](https://www.kaggle.com/c/titanic) на платформе [Kaggle](https://www.kaggle.com)). Датасет лежит по пути `src/titanic.csv`

## Задание 1
Загрузите таблицу из файла `data.csv` в переменную `df` типа `pd.DataFrame`. В качестве индекса следует использовать колонку `PassengerId`.

In [28]:
import pandas as pd
df = pd.read_csv('titanic.csv',index_col='PassengerId',sep=',',encoding='UTF-8')
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Задание 1.1
Сколько строк и столбцов в таблице? Ответом в форме будет кол-во строк умноженное на кол-во столбцов.

In [29]:
a = df.shape
a[0]*a[1]

9801

## Задание 1.2
Отсортируйте Dataframe по возрастанию столбца `Age`. Выведите на экран первые три значения столбца `Age`(возраст).
Ответом в форме будет сумма возрастов первых трех пассажиров в отсортированном Dataframe (с двумя знаками после запятой, округленной функцией `round в python 3`).

In [30]:
a = df.sort_values(['Age']).head(3)
round(a['Age'].sum(), 2)

1.84

## Задание 1.3

Какова доля выживших (поле `Survived`)? Ответом в форме будет число (с двумя знаками после запятой, округленной функцией `round в python 3`)

In [31]:
round(df.Survived.mean(), 2)

0.38

## Задание 1.4
Каковы доли женщин и мужчин среди пассажиров (поле `Sex`)? Ответом в форме будет абсолют разницы между значениями (с двумя знаками после запятой, округленной функцией `round в python 3`)

In [32]:
x = (df.Sex == 'female').mean()
y = (df.Sex == 'male').mean()
round(y-x,2)

0.3

## Задание 1.5
Какова доля совершеннолетних пассажиров (18 лет и старше)? Ответом в форме будет число (с двумя знаками после запятой, округленной функцией `round в python 3`)

In [33]:
round((df.Age >= 18).mean(), 2)

0.67

## Задание 1.6
Замените коды пассажирских классов (поле `Pclass`) их названиями (1 = Upper, 2 = Middle, 3 = Lower). Результат выведите на экран. Выведите Dataframe с Pclass = Lower и  Age > 10.0. Ответом в форме будет кол-во строк умноженное на кол-во столбцов этого Dataframe.

In [34]:
def pclass(txt):
    a = {1: 'Upper',2:'Middle',3:'Lower'}
    return(a.get(txt))

df['Pclass'] = df['Pclass'].apply(pclass)

In [35]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,Lower,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,Upper,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,Lower,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,Upper,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,Lower,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [36]:
a = df[(df['Pclass'] == 'Lower') & (df['Age'] > 10)].shape
print(a[0] * a[1])

3421

## Задача 1.7
Какова доля выживших среди женщин?

In [37]:
round(df.loc[df.Sex == 'female', 'Survived'].mean(), 2)

0.74

## Задача 1.8
Сколько всего пропущенных значений в таблице?

In [38]:
k = 0
for i in df.columns:
    k = k + df[i].isnull().sum()
print(k)

866

## Задание 1.9
Добавьте в таблицу поле `Surname` – фамилию пассажира (первое слово до запятой).
Посчитайте в отдельном столбце `Surname_len` - длину фамилии пассажира. Сложите длины всех фамилий - это и будет ответом в форме.

In [39]:
def x(txt):
#     txt1 = [txt.split(',')[0]]
    return(txt.split(',')[0])
def y (txt):
    return(len(txt))

df['Surname'] = df['Name'].apply(x)
df['Surname_len'] = df['Surname'].apply(y)
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Surname_len
PassengerId,,,,,,,,,,,,,
1,0,Lower,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,6
2,1,Upper,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,7
3,1,Lower,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,9
4,1,Upper,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,8
5,0,Lower,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,5

In [40]:
a = df['Surname_len'].sum()
a

6099

## Задание 1.10
Найдите всех пассажиров с аномальной стоимостью билета (поле `Fare`). Будем считать стоимость аномальной, если она отличается от среднего более, чем на 5 стандартных отклонений. Выведите соответствующие строки таблицы на экран. Ответом в форме будет наименьший PassengerId.

In [41]:
a = df['Fare'].std() * 5
b = df['Fare'].mean()
df10 = df[df['Fare'] - b > a]
df10.index[0]

259

## Задание 1.11
Выведите на экран столбцы, в которых бывают пропущенные значения. (Hint: *Здесь может помочь метод* `.any()`*, а также индексация переменной* `df.columns`). Перечислите названия всех столбцов по алфавитному порядку через запятую - это будет ответом (Например, ответ в форме - 'Age, Cabin, Name, Survived, Pclass')

In [14]:
a = df.isnull().sum()

In [15]:
a

Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Surname          0
Surname_len      0
dtype: int64

In [16]:
a = df.isnull().any()

In [17]:
a = a[a == True]
for i in a.index:
    print(i)

Age
Cabin
Embarked

# Задание 1.12
Выведите на картинке распределение возрастов женщин с ценой билета меньше 250.0 и медиану (matplotlib или seaborn), а также на ней распределение возрастов мужчин с ценой билета меньше 250.0 и медиану.
Ответом к форме будет эта картинка (загрузите на любой фотохостинг и вставьте url).

In [18]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Surname_len
PassengerId,,,,,,,,,,,,,
1,0,Lower,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,6
2,1,Upper,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,7
3,1,Lower,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,9
4,1,Upper,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,8
5,0,Lower,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,5

In [23]:
female = df[(df['Fare'] < 250) & (df['Sex'] == 'female')].sort_values(by = 'Age')
fe_mean = female['Age'].mean()

In [24]:
male = df[(df['Fare'] < 250) & (df['Sex'] == 'male')].sort_values(by = 'Age')
ma_mean = male['Age'].mean()

In [25]:
plt.hist(female['Age'], label = 'female' , alpha = 0.5)
plt.hist(male['Age'], label = 'male',alpha = 0.5 )
plt.axvline(fe_mean, color = 'yellow')
plt.axvline(ma_mean, color = 'green')
plt.legend()
plt.show()

AttributeError: module 'matplotlib' has no attribute 'hist'

### https://forms.gle/JoyGhhHJaa1jag7G7 - ссылка на форму